Repository: inugamine/NagiKasten
Catalog: Kasten/Localizable.xcstrings
Source language: en
Languages: ja

source: "System" follows the macOS light/dark setting. "Art Deco" is dark only, and also changes the prompt decoration. Use "Custom" to set each color freely (no decoration).
ja: 「システム」は macOS のライト/ダーク設定に追従します。「アール・デコ」は暗色のみで、プロンプトの装飾も切り替わります。「カスタム」で各色を自由に設定できます（装飾は付きません）。

# AIは man ページの参照と、コマンドが実際にこの Mac に入っているかの確認ができます。これらは常に有効です。
source: AI can look up man pages and check whether a command is actually installed on this Mac. These are always enabled.
ja: AIは man ページの参照と、コマンドが実際にこの Mac に入っているかの確認ができます。これらは常に有効です。

# AIへの問い合わせに失敗しました: %@
source: Failed to query the AI: %@
ja: AIへの問い合わせに失敗しました: %@

# ANSI（明るい）
source: ANSI (Bright)
ja: ANSI（明るい）

# ANSI（通常）
source: ANSI (Normal)
ja: ANSI（通常）

# Apple Intelligence が利用できません。
source: Apple Intelligence is not available.
ja: Apple Intelligence が利用できません。

# Apple Intelligence が利用できません。設定から有効にしてください。
source: Apple Intelligence is not available. Enable it in System Settings.
ja: Apple Intelligence が利用できません。設定から有効にしてください。

# GitHub の API 制限に達しました。しばらく待ってからお試しください。
source: You've reached GitHub's API rate limit. Please wait a while and try again.
ja: GitHub の API 制限に達しました。しばらく待ってからお試しください。

# NagiKasten について
source: About NagiKasten
ja: NagiKasten について

# NagiKasten は以下のオープンソースソフトウェアを利用しています。
source: NagiKasten uses the following open source software.
ja: NagiKasten は以下のオープンソースソフトウェアを利用しています。

# アール・デコ
source: Art Deco
ja: アール・デコ

# アップデートを確認…
source: Check for Updates…
ja: アップデートを確認…

# アップデートを確認できませんでした
source: Couldn't check for updates
ja: アップデートを確認できませんでした

# エラー解析
source: Error Analysis
ja: エラー解析

# エラー解析に失敗しました: %@
source: Error analysis failed: %@
ja: エラー解析に失敗しました: %@

# お使いの NagiKasten は最新です
source: NagiKasten is up to date
ja: お使いの NagiKasten は最新です

# カーソル
source: Cursor
ja: カーソル

# カスタム
source: Custom
ja: カスタム

# カスタム色
source: Custom Colors
ja: カスタム色

# グラデーションにする
source: Use a gradient
ja: グラデーションにする

# この Mac は Apple Intelligence に対応していません。
source: This Mac does not support Apple Intelligence.
ja: この Mac は Apple Intelligence に対応していません。

# このバージョンをスキップ
source: Skip This Version
ja: このバージョンをスキップ

# コピー
source: Copy
ja: コピー

# コンテキスト長
source: Context Length
ja: コンテキスト長

# サーバーからの応答を解釈できませんでした。
source: Couldn't read the response from the server.
ja: サーバーからの応答を解釈できませんでした。

# シアン
source: Cyan
ja: シアン

# シェル履歴の参照を許可する
source: Allow access to shell history
ja: シェル履歴の参照を許可する

# システム
source: System
ja: システム

# ダーク
source: Dark
ja: ダーク

# ターミナルに解析できる内容がありません。
source: There is nothing on the terminal to analyze.
ja: ターミナルに解析できる内容がありません。

# ターミナル画面の内容
source: Terminal screen contents
ja: ターミナル画面の内容

# ダウンロード
source: Download
ja: ダウンロード

# ツール
source: Tools
ja: ツール

# テーマ
source: Theme
ja: テーマ

# バージョン %@
source: Version %@
ja: バージョン %@

# バージョン番号を解釈できませんでした。
source: Couldn't read the version number.
ja: バージョン番号を解釈できませんでした。

# プリセットから複製
source: Duplicate from Preset
ja: プリセットから複製

# プロセスが完了しました
source: Process completed
ja: プロセスが完了しました

# ペースト
source: Paste
ja: ペースト

# マゼンタ
source: Magenta
ja: マゼンタ

# モデル
source: Model
ja: モデル

# モデルを準備中です。しばらく待ってから再度お試しください。
source: The model is getting ready. Please wait a moment and try again.
ja: モデルを準備中です。しばらく待ってから再度お試しください。

# ライト
source: Light
ja: ライト

# 上の色
source: Top color
ja: 上の色

# 下の色
source: Bottom color
ja: 下の色

# 全選択
source: Select All
ja: 全選択

# 公開されているリリースが見つかりませんでした。
source: No published release was found.
ja: 公開されているリリースが見つかりませんでした。

# 利用可能
source: Available
ja: 利用可能

# 前景
source: Foreground
ja: 前景

# 原因
source: Cause
ja: 原因

# 基本
source: Basic
ja: 基本

# 外観
source: Appearance
ja: 外観

# 後で
source: Later
ja: 後で

# 挿入
source: Insert
ja: 挿入

# 新しいバージョンがあります
source: A new version is available
ja: 新しいバージョンがあります

# 明るいシアン
source: Bright Cyan
ja: 明るいシアン

# 明るいマゼンタ
source: Bright Magenta
ja: 明るいマゼンタ

# 明るい白
source: Bright White
ja: 明るい白

# 明るい緑
source: Bright Green
ja: 明るい緑

# 明るい赤
source: Bright Red
ja: 明るい赤

# 明るい青
source: Bright Blue
ja: 明るい青

# 明るい黄
source: Bright Yellow
ja: 明るい黄

# 明るい黒（グレー）
source: Bright Black (Gray)
ja: 明るい黒（グレー）

# 状態
source: Status
ja: 状態

# 現在 %@ → 最新 %@
source: Current %@ → Latest %@
ja: 現在 %@ → 最新 %@

# 現在のターミナル画面のエラーを解析（⌘E）
source: Analyze errors on the current terminal screen (⌘E)
ja: 現在のターミナル画面のエラーを解析（⌘E）

# 白
source: White
ja: 白

# 種別
source: Type
ja: 種別

# 緑
source: Green
ja: 緑

# 考え中...
source: Thinking...
ja: 考え中...

# 背景
source: Background
ja: 背景

# 背景色
source: Background color
ja: 背景色

# 解析できる内容が残りませんでした。ターミナルの表示を減らしてからお試しください。
source: No content was left to analyze. Try again after reducing what the terminal shows.
ja: 解析できる内容が残りませんでした。ターミナルの表示を減らしてからお試しください。

# 解析中...
source: Analyzing...
ja: 解析中...

# 解決策
source: Solution
ja: 解決策

# 設定から Apple Intelligence を有効にしてください。
source: Enable Apple Intelligence in System Settings.
ja: 設定から Apple Intelligence を有効にしてください。

# 赤
source: Red
ja: 赤

# 通信に失敗しました（HTTP %lld）。
source: The connection failed (HTTP %lld).
ja: 通信に失敗しました（HTTP %lld）。

source: AI can search the commands you have run before, which makes its suggestions more accurate. Note that your history may contain things you would rather not expose, such as API keys or host names. Everything is processed on this Mac and nothing is sent anywhere.
ja: 過去に実行したコマンドを AI が検索できるようになり、提案の精度が上がります。ただし履歴には API キーやホスト名など、見せたくない内容が混ざっていることがあります。処理はすべてこの Mac の中で完結し、外部には送信されません。

# 選択範囲
source: Selection
ja: 選択範囲

# 閉じる
source: Close
ja: 閉じる

# 青
source: Blue
ja: 青

# 黄
source: Yellow
ja: 黄

# 黒
source: Black
ja: 黒
